common/models/User.php

SELECT * FROM `user` WHERE (`username`='admin') AND (`status`=10)
---
    public static function findByUsername($username)
    {
        return self::find()->where(['username' => $username, 'status' => self::STATUS_ACTIVE])->one();